import { firast } from "./index";

describe("Firast", () => {
  test("cleanup simple sentences", () => {
    expect(
      firast(
        "فيراستار به شما كمك مي كند تا متون فارسي زيبا تر و درست تري بنويسيد .",
      ),
    ).toBe(
      "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید.",
    );
  });

  test("cleanup simple sentences", () => {
    expect(firast("فيراستار به طور پيش فرض اين کار ها را انجام می دهد :")).toBe(
      "ویراستار به طور پیش فرض این کارها را انجام می‌دهد:",
    );
  });

  test("cleanup simple sentences #1", () => {
    expect(
      firast(
        "1. نویسه های عربي را به فارسی تبديل مي کند.  مثلا كاف و ياي عربي .",
      ),
    ).toBe("۱. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی.");
  });

  test("cleanup simple sentences #2", () => {
    expect(
      firast(
        // eslint-disable-next-line quotes
        '2. نویسه های انگليسي رايج در تايپ فارسي را به معادل صحيح فارسي آن تبدیل می کند, مثلا تبدیل کامای انگلیسی به ویرگول (,), يا نقطه ویرگول به جای semicolon (;) و یا استفاده از "گيومه های فارسي"',
      ),
    ).toBe(
      "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»",
    );
  });

  test("cleanup simple sentences #3", () => {
    expect(
      firast(
        "3. اعداد عربي و انگليسي و علائم رياضی را به معادل فارسی آن ها تبديل مي کند.    مثلا  :  12%  456",
      ),
    ).toBe(
      "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪ ۴۵۶",
    );
  });

  test("cleanup simple sentences #4", () => {
    expect(
      firast(
        "4. سه نقطه را به نويسه صحيح آن که تنها يك نويسه است تبديل کرده و فاصله گذاري آن را اصلاح مي کند ...",
      ),
    ).toBe(
      "۴. سه نقطه را به نویسه صحیح آن که تنها یک نویسه است تبدیل کرده و فاصله گذاری آن را اصلاح می‌کند…",
    );
  });
});
